---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarCoupler.CouplerLinkTwoBars
source: html/f9b71707-f877-c2a2-1297-a132766e0c53.htm
---
# Autodesk.Revit.DB.Structure.RebarCoupler.CouplerLinkTwoBars Method

returns true if the coupler sits on two rebar and false otherwise

## Syntax (C#)
```csharp
public bool CouplerLinkTwoBars()
```